app/controllers/home_controller.rb

SELECT "projects".* FROM "projects" WHERE ("projects"."company" != 'Personal')
---
  def index
    @industry_projects = Project.where.not(company:'Personal')