app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE ("projects"."company" != 'Personal')
---
  def industry_index
    @industry_projects = Project.where.not(company:'Personal')

SELECT "projects".* FROM "projects" WHERE "projects"."company" = 'Personal'
---
  def personal_index
    @personal_projects = Project.where(company:'Personal')